Study2/src/Documents/СнятиеСЗаказа/СнятиеСЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СнятиеСЗаказа</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ЗаказанныеТовары</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалПоставки</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>EnumRef.ПричиныОтменыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Study2/src/AccumulationRegisters/ЗаказанныеТовары/ЗаказанныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказанныеТовары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Study2/src/Documents/СнятиеСЗаказа/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СоставЦенаИЛИКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если (ТекДанные <> Неопределено) Тогда
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	КонецЕсли;
	ПересчитатьСуммуДокумента();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Состав.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоставНоменклатураПриИзмененииНаСервере(ДокументОснование, Номенклатура)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗаказанныеТоварыОстатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ЗаказанныеТовары.Остатки(, Заказ = &Заказ) КАК ЗаказанныеТоварыОстатки");
	Запрос.УстановитьПараметр("Заказ", ДокументОснование);
	ТаблицаЗароса = Запрос.Выполнить().Выгрузить();
	НайденнаяСтрока = ТаблицаЗароса.Найти(Номенклатура,"Номенклатура");
	
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат Истина 
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если СоставНоменклатураПриИзмененииНаСервере(Объект.ДокументОснование, ТекДанные.Номенклатура) Тогда
		Сообщить("Товар " + ТекДанные.Номенклатура + " не был заказан, либо принят получателем");
		ТекДанные.Номенклатура = "";
	КонецЕсли;
	
	КонецПроцедуры
